Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPms_bf.h
/**
 * \file IfxPms_bf.h
 * \brief
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Pms_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Pms_Registers
 * 
 */
#ifndef IFXPMS_BF_H
#define IFXPMS_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Pms_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVRC */
#define IFX_PMS_EVRSTAT_EVRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVRC */
#define IFX_PMS_EVRSTAT_EVRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVRC */
#define IFX_PMS_EVRSTAT_EVRC_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVC */
#define IFX_PMS_EVRSTAT_OVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVC */
#define IFX_PMS_EVRSTAT_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVC */
#define IFX_PMS_EVRSTAT_OVC_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVR33 */
#define IFX_PMS_EVRSTAT_EVR33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVR33 */
#define IFX_PMS_EVRSTAT_EVR33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVR33 */
#define IFX_PMS_EVRSTAT_EVR33_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OV33 */
#define IFX_PMS_EVRSTAT_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OV33 */
#define IFX_PMS_EVRSTAT_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OV33 */
#define IFX_PMS_EVRSTAT_OV33_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVSWD */
#define IFX_PMS_EVRSTAT_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVSWD */
#define IFX_PMS_EVRSTAT_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVSWD */
#define IFX_PMS_EVRSTAT_OVSWD_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVC */
#define IFX_PMS_EVRSTAT_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVC */
#define IFX_PMS_EVRSTAT_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVC */
#define IFX_PMS_EVRSTAT_UVC_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UV33 */
#define IFX_PMS_EVRSTAT_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UV33 */
#define IFX_PMS_EVRSTAT_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UV33 */
#define IFX_PMS_EVRSTAT_UV33_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVSWD */
#define IFX_PMS_EVRSTAT_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVSWD */
#define IFX_PMS_EVRSTAT_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVSWD */
#define IFX_PMS_EVRSTAT_UVSWD_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.SYNCLCK */
#define IFX_PMS_EVRSTAT_SYNCLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.SYNCLCK */
#define IFX_PMS_EVRSTAT_SYNCLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.SYNCLCK */
#define IFX_PMS_EVRSTAT_SYNCLCK_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVR33VOK */
#define IFX_PMS_EVRSTAT_EVR33VOK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVR33VOK */
#define IFX_PMS_EVRSTAT_EVR33VOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVR33VOK */
#define IFX_PMS_EVRSTAT_EVR33VOK_OFF (9u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.RSTC */
#define IFX_PMS_EVRSTAT_RSTC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.RSTC */
#define IFX_PMS_EVRSTAT_RSTC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.RSTC */
#define IFX_PMS_EVRSTAT_RSTC_OFF (13u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.RST33 */
#define IFX_PMS_EVRSTAT_RST33_LEN (1u)

