Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL1_M0TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL1_M0TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0TON */
#define IFX_PMS_EVRSDCTRL1_M0TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL1_M0S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL1_M0S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0S0COEFF */
#define IFX_PMS_EVRSDCTRL1_M0S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL1_M0DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL1_M0DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0DEADBD */
#define IFX_PMS_EVRSDCTRL1_M0DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL1_M0ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL1_M0ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0ADCZB */
#define IFX_PMS_EVRSDCTRL1_M0ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL1_M0SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL1_M0SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.M0SKIP */
#define IFX_PMS_EVRSDCTRL1_M0SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL1_SYNCEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL1_SYNCEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.SYNCEN */
#define IFX_PMS_EVRSDCTRL1_SYNCEN_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL1_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL1_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL1_Bits.LCK */
#define IFX_PMS_EVRSDCTRL1_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL2_LPBNDOFFSET_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL2_LPBNDOFFSET_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDOFFSET */
#define IFX_PMS_EVRSDCTRL2_LPBNDOFFSET_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL2_LPBNDWIDTH_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL2_LPBNDWIDTH_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.LPBNDWIDTH */
#define IFX_PMS_EVRSDCTRL2_LPBNDWIDTH_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL2_LPLPFCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL2_LPLPFCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.LPLPFCOEFF */
#define IFX_PMS_EVRSDCTRL2_LPLPFCOEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL2_SDFREQLP_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL2_SDFREQLP_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.SDFREQLP */
#define IFX_PMS_EVRSDCTRL2_SDFREQLP_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL2_EVRCMOD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL2_EVRCMOD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.EVRCMOD */
#define IFX_PMS_EVRSDCTRL2_EVRCMOD_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL2_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL2_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL2_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL3_M1TOFF_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL3_M1TOFF_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.M1TOFF */
#define IFX_PMS_EVRSDCTRL3_M1TOFF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL3_M1TON_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL3_M1TON_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.M1TON */
#define IFX_PMS_EVRSDCTRL3_M1TON_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL3_M1S0COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL3_M1S0COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.M1S0COEFF */
#define IFX_PMS_EVRSDCTRL3_M1S0COEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL3_M1DEADBD_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL3_M1DEADBD_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.M1DEADBD */
#define IFX_PMS_EVRSDCTRL3_M1DEADBD_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL3_M1ADCZB_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL3_M1ADCZB_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.M1ADCZB */
#define IFX_PMS_EVRSDCTRL3_M1ADCZB_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL3_M1SKIP_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL3_M1SKIP_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.M1SKIP */
#define IFX_PMS_EVRSDCTRL3_M1SKIP_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL4_VOKCFG_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL4_VOKCFG_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.VOKCFG */
#define IFX_PMS_EVRSDCTRL4_VOKCFG_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL4_SDFREQST_LEN (12u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL4_SDFREQST_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.SDFREQST */
#define IFX_PMS_EVRSDCTRL4_SDFREQST_OFF (16u)

